Tekla.Structures.Dialog.UIControls.BoltCatalogStandard
The BoltCatalogStandard class represents a control to select the bolt standard
using the bolt catalog.
Bolt catalog controls always need to be in pairs, meaning in every dialog
there has to be a BoltCatalogStandard and a BoltCatalogSize control.
The property BoltCatalogStandard.LinkedBoltCatalogSize sets to which BoltCatalogSize the
control is linked.

Tekla.Structures.Dialog.UIControls.BoltCatalogStandard.#ctor
Initiates a new instance of the control.

Tekla.Structures.Dialog.UIControls.BoltCatalogStandard.LinkedBoltCatalogSize
The BoltCatalogSize control linked to the BoltCatalogStandard control.
Bolt catalog controls always need to be in pairs, meaning in every dialog
there has to be a BoltCatalogStandard and a BoltCatalogSize control.

Tekla.Structures.Dialog.UIControls.BoltCatalogStandard.OnCreateControl
When the control is created in the parent dialog,
enumerates the bolt catalog to fill the controls.

Tekla.Structures.Dialog.UIControls.BoltCatalogStandard.OnSelectedIndexChanged(System.EventArgs)
When the selected index changes, updates the values
in the BoltCatalogSize combo box.
EventArgs: The event arguments.

Tekla.Structures.Dialog.UIControls.BoltCatalogStandard.OnParentVisibleChanged(System.EventArgs)
When the parent is visible, updates the values in the
BoltCatalogSize combo box.
EventArgs: The event arguments.

Tekla.Structures.Dialog.UIControls.BoltCatalogStandard.OnClick(System.EventArgs)
When the control is clicked, values are not loaded from a file.
EventArgs: The event arguments.